-- MS SQL Server

/*==================================================================================================================================================*/
/* --- --- Процесс / Process --- --- */
/*==================================================================================================================================================*/

	-- При начале регистрации потенциальные клиенты записываются в таблицу Ankets. Full_name - ФИО в нижнем регистре через пробел (иванов иван иванович).
	-- Если не прошел регистрацию, то там и остаётся. После окончания прохождения создаётся запись в clients, accounts, но также остаётся в ankets, не удаляется.
	-- Сделки клиента хранятся в trades. Papers_cnt количество купленных/проданных бумаг, papers_value цена одной бумаги.
	-- Если papers_cnt > 0 это покупка, если < 0, то продажа. Комиссия от продажи/покупки рассчитывается как общая сумма купленных/проданных бумаг в рамках одной сделки * tax_rate

/*==================================================================================================================================================*/
/* --- --- Подготовка исходных данных / Preperation of source data --- --- */
/*==================================================================================================================================================*/

	/* --- ankets --- */
		
		IF OBJECT_ID('tempdb.dbo.##ankets', 'U') IS NOT null
		DROP TABLE ##ankets;

		CREATE TABLE ##ankets (
			  ank_no INT IDENTITY(1, 1)
			, full_name VARCHAR(128)
			, birth_date DATE);

		INSERT INTO ##ankets VALUES
			('иванов1 иван1 иванович1', '1970-01-01'), -- 1
			('иванов2 иван2 иванович2', '1971-01-01'),
			('иванов3 иван3 иванович3', '1972-01-01'),
			('иванов4 иван4 иванович4', '1973-01-01'),
			('иванов5 иван5 иванович5', '1974-01-01'), -- 5
			('иванов6 иван6 иванович6', '1975-01-01'),
			('иванов7 иван7 иванович7', '1976-01-01'),
			('иванов8 иван8 иванович8', '1977-01-01'),
			('иванов9 иван9 иванович9', '1978-01-01'),
			('иванов10 иван10 иванович10', '1979-01-01'), -- 10
			('иванов11 иван11 иванович11', '1980-01-01'),
			('иванов12 иван12 иванович12', '1981-01-01'),
			('иванов13 иван13 иванович13', '1982-01-01'),
			('иванов14 иван14 иванович14', '1983-01-01'),
			('иванов15 иван15 иванович15', '1984-01-01'), -- 15
			('иванов16 иван16 иванович16', '1985-01-01'),
			('иванов17 иван17 иванович17', '1986-01-01'),
			('иванов18 иван18 иванович18', '1987-01-01'),
			('иванов19 иван19 иванович19', '1988-01-01'),
			('иванов20 иван20 иванович20', '1989-01-01'), -- 20
			('иванов21 иван21 иванович21', '1990-01-01'),
			('иванов22 михаил иванович22', '1991-01-01'),
			('иванов23 михаил2 иванович23', '1992-01-01'),
			('иванов11111 михаил11111 иванович111', '1990-01-01'),
			('иванов11112 михаил11111 иванович111', '1990-01-01'), --25
			('иванов11113 михаил11111 иванович111', '1990-01-01'),
			('иванов11114 михаил11111 иванович111', '1990-01-01'),
			('иванов11115 михаил11111 иванович111', '1990-01-01'),
			('иванов11116 михаил11111 иванович111', '1990-01-01'),
			('иванов11117 михаил11111 иванович111', '1990-01-01'); --30

	/* --- clients --- */

		IF OBJECT_ID('tempdb.dbo.##clients', 'U') IS NOT null
		DROP TABLE ##clients;

		CREATE TABLE ##clients (
			  client_id INT IDENTITY(1, 1)
			, ank_no INT);

		INSERT INTO ##clients VALUES
			(1), (3), (5), (7), (9), (11), (13), (15), (17), (19), (21), (22), (24), (25), (26), (27), (28), (29), (30);

	/* --- tarifs --- */

		IF OBJECT_ID('tempdb.dbo.##tarifs', 'U') IS NOT null
		DROP TABLE ##tarifs;

		CREATE TABLE ##tarifs (
			  tp_code INT IDENTITY(1, 1)
			, tax_rate FLOAT);

		INSERT INTO ##tarifs VALUES
			(2.5), (5.0), (7.5), (10.0), (12.5);
	
	/* --- accounts --- */

		IF OBJECT_ID('tempdb.dbo.##accounts', 'U') IS NOT null
		DROP TABLE ##accounts;

		CREATE TABLE ##accounts (
			  treaty INT IDENTITY(1, 1)
			, client_id INT
			, accnumber VARCHAR(17)
			, tp_code INT);

		INSERT INTO ##accounts VALUES
			(1, 'AAAAA-AAAAA-AAAAA', 1),
			(2, 'AAAAA-AAAAA-BBBBB', 1),
			(3, 'AAAAA-BBBBB-BBBBB', 1),
			(4, 'BBBBB-BBBBB-BBBBB', 2),
			(5, 'BBBBB-BBBBB-CCCCC', 2),
			(6, 'BBBBB-CCCCC-CCCCC', 2),
			(7, 'CCCCC-CCCCC-CCCCC', 3),
			(8, 'CCCCC-CCCCC-DDDDD', 3),
			(9, 'CCCCC-DDDDD-DDDDD', 3),
			(10, 'DDDDD-DDDDD-DDDDD', 4),
			(11, 'EEEEE-EEEEE-EEEEE', 4),
			(13, 'FFFFF-FFFFF-FFFFF', 5),
			(14, 'GGGGG-GGGGG-GGGGG', 5),
			(15, 'HHHHH-HHHHH-HHHHH', 5),
			(16, 'IIIII-IIIII-IIIII', 5),
			(17, 'JJJJJ-JJJJJ-JJJJJ', 5),
			(18, 'KKKKK-KKKKK-KKKKK', 5),
			(19, 'LLLLL-LLLLL-LLLLL', 5);

	/* --- trades --- */
		
		IF OBJECT_ID('tempdb.dbo.##trades', 'U') IS NOT null
		DROP TABLE ##trades;

		CREATE TABLE ##trades (
			  trades_id INT IDENTITY(1, 1)
			, papers_cnt INT
			, papers_value DECIMAL
			, treaty INT);

		INSERT INTO ##trades VALUES
			(-10, 100.00, 1), (-100, 100.00, 1), (-1000, 100.00, 1),
			(10, 100.00, 1), (100, 100.00, 1), (1000, 100.00, 1),
			(-10, 500.00, 1), (-100, 500.00, 1), (-1000, 500.00, 1),
			(10, 500.00, 1), (100, 500.00, 1), (1000, 500.00, 1),
			(-10, 1000.00, 1), (-100, 1000.00, 1), (-1000, 1000.00, 1),
			(10, 1000.00, 1), (100, 1000.00, 1), (1000, 1000.00, 1),
        
			(-10, 100.00, 2), (-100, 100.00, 3), (-1000, 100.00, 4),
			(10, 100.00, 5), (100, 100.00, 6), (1000, 100.00, 7),
			(-10, 500.00, 8), (-100, 500.00, 9), (-1000, 500.00, 10),
			(10, 500.00, 11), (100, 500.00, 2), (1000, 500.00, 3),
			(-10, 1000.00, 4), (-100, 1000.00, 5), (-1000, 1000.00, 6),
			(10, 1000.00, 7), (100, 1000.00, 8), (1000, 1000.00, 9),
        
			(10, 1000.00, 7), (100, 1000.00, 8), (1000, 1000.00, 9),
			(10, 1000.00, 7), (100, 1000.00, 8), (1000, 1000.00, 9),
			(-10, 100.00, 2), (-10, 100.00, 2), (-10, 100.00, 2), (-10, 100.00, 2),
			
			(10, 1000.00, 12), (100, 1000.00, 12), (1000, 1000.00, 12),
			(10, 1000.00, 13), (100, 1000.00, 13), (1000, 1000.00, 13),
			(10, 1000.00, 14), (100, 1000.00, 14), (1000, 1000.00, 14),
			(10, 1000.00, 15), (100, 1000.00, 15), (1000, 1000.00, 15),
			(10, 1000.00, 16), (100, 1000.00, 16), (1000, 1000.00, 16),
			(10, 1000.00, 17), (100, 1000.00, 17), (1000, 1000.00, 17),
			(10, 1000.00, 18), (100, 1000.00, 18), (1000, 1000.00, 18),
			(10, 1000.00, 19), (100, 1000.00, 19), (1000, 1000.00, 19),
			
			(-10, 100.00, 12), (-10, 100.00, 12), (-10, 100.00, 12),
			(-10, 100.00, 13), (-10, 100.00, 13), (-10, 100.00, 13),
			(-10, 100.00, 14), (-10, 100.00, 14), (-10, 100.00, 14),
			(-10, 100.00, 15), (-10, 100.00, 15), (-10, 100.00, 15),
			(-10, 100.00, 16), (-10, 100.00, 16), (-10, 100.00, 16),
			(-10, 100.00, 17), (-10, 100.00, 17), (-10, 100.00, 17),
			(-10, 100.00, 18), (-10, 100.00, 18), (-10, 100.00, 18),
			(-10, 100.00, 19), (-10, 100.00, 19), (-10, 100.00, 19);

/*==================================================================================================================================================*/
/* --- --- Задание / Task --- --- */
/*==================================================================================================================================================*/

	-- Вывести общую сумму всех покупок и всех продаж (отдельным столбцами), общую сумму комиссии (и покупок и продаж вместе), 
	-- всех клиентов 1990 года рождения, длина фамилии которых не меньше чем 10 символов.
	-- Комиссия от продажи/покупки рассчитывается как общая сумма купленных/проданных бумаг в рамках одной сделки * tax_rate

	SELECT
		  full_name
		, treaty
		, SUM(p_papers_value)
		, SUM(s_papers_value)
		, SUM((p_papers_value + s_papers_value) * (tax_rate /100)) AS "Comission"
	FROM (
		SELECT
			  ank.ank_no
			, cl.client_id
			, ank.full_name
			, ank.birth_date
			, acc.treaty
			, acc.accnumber
			, t.tp_code
			, t.tax_rate
			, tr_p.trades_id	AS "p_trades_id"
			, tr_p.papers_cnt	AS "p_papers_cnt"
			, tr_p.papers_value	AS "p_papers_value"
			, tr_s.trades_id	AS "s_trades_id"
			, tr_s.papers_cnt	AS "s_papers_cnt"
			, tr_s.papers_value	AS "s_papers_value"
		FROM ##ankets ank
			LEFT JOIN ##clients cl	 ON ank.ank_no = cl.ank_no
				LEFT JOIN ##accounts acc ON cl.client_id = acc.client_id
					LEFT JOIN ##tarifs t	 ON acc.tp_code = t.tp_code
					LEFT JOIN ##trades tr_p	 ON acc.treaty = tr_p.treaty AND tr_p.papers_cnt > 0
					LEFT JOIN ##trades tr_s	 ON acc.treaty = tr_s.treaty AND tr_s.papers_cnt < 0
		WHERE 1=1
			AND cl.client_id IS NOT null
			AND YEAR(ank.birth_date) = 1990
			AND LEN(SUBSTRING(ank.full_name, 0, CHARINDEX(' ', ank.full_name, 0))) > 10
		) AS my_table
	GROUP BY full_name, treaty;

/*==================================================================================================================================================*/
/* --- --- Удалить временные таблицы / Delete temporary tables --- --- */
/*==================================================================================================================================================*/

	IF OBJECT_ID('tempdb.dbo.##ankets', 'U') IS NOT null DROP TABLE ##ankets;
	IF OBJECT_ID('tempdb.dbo.##clients', 'U') IS NOT null DROP TABLE ##clients;
	IF OBJECT_ID('tempdb.dbo.##tarifs', 'U') IS NOT null DROP TABLE ##tarifs;
	IF OBJECT_ID('tempdb.dbo.##accounts', 'U') IS NOT null DROP TABLE ##accounts;
	IF OBJECT_ID('tempdb.dbo.##trades', 'U') IS NOT null DROP TABLE ##trades;