-- MS SQL Server

/*==================================================================================================================================================*/
/* --- --- Процесс / Process --- --- */
/*==================================================================================================================================================*/

	-- При начале регистрации потенциальные клиенты записываются в таблицу Ankets. Full_name - ФИО в нижнем регистре через пробел (иванов иван иванович).
	-- Если не прошел регистрацию, то там и остаётся. После окончания прохождения создаётся запись в clients, accounts, но также остаётся в ankets, не удаляется.
	-- Сделки клиента хранятся в trades. Papers_cnt количество купленных/проданных бумаг, papers_value цена одной бумаги.
	-- Если papers_cnt > 0 это покупка, если < 0, то продажа. Комиссия от продажи/покупки рассчитывается как общая сумма купленных/проданных бумаг в рамках одной сделки * tax_rate

/*==================================================================================================================================================*/
/* --- --- Подготовка исходных данных / Preperation of source data --- --- */
/*==================================================================================================================================================*/

	/* --- ankets --- */
		
		IF OBJECT_ID('tempdb.dbo.##ankets', 'U') IS NOT null
		DROP TABLE ##ankets;

		CREATE TABLE ##ankets (
			  ank_no INT IDENTITY(1, 1)
			, full_name VARCHAR(128)
			, birth_date DATE);

		INSERT INTO ##ankets VALUES
			('иванов1 иван1 иванович1', '1970-01-01'), -- 1
			('иванов2 иван2 иванович2', '1971-01-01'),
			('иванов3 иван3 иванович3', '1972-01-01'),
			('иванов4 иван4 иванович4', '1973-01-01'),
			('иванов5 иван5 иванович5', '1974-01-01'), -- 5
			('иванов6 иван6 иванович6', '1975-01-01'),
			('иванов7 иван7 иванович7', '1976-01-01'),
			('иванов8 иван8 иванович8', '1977-01-01'),
			('иванов9 иван9 иванович9', '1978-01-01'),
			('иванов10 иван10 иванович10', '1979-01-01'), -- 10
			('иванов11 иван11 иванович11', '1980-01-01'),
			('иванов12 иван12 иванович12', '1981-01-01'),
			('иванов13 иван13 иванович13', '1982-01-01'),
			('иванов14 иван14 иванович14', '1983-01-01'),
			('иванов15 иван15 иванович15', '1984-01-01'), -- 15
			('иванов16 иван16 иванович16', '1985-01-01'),
			('иванов17 иван17 иванович17', '1986-01-01'),
			('иванов18 иван18 иванович18', '1987-01-01'),
			('иванов19 иван19 иванович19', '1988-01-01'),
			('иванов20 иван20 иванович20', '1989-01-01'), -- 20
			('иванов21 иван21 иванович21', '1990-01-01'),
			('иванов22 михаил иванович22', '1991-01-01'),
			('иванов23 михаил2 иванович23', '1992-01-01'),
			('иванов11111 михаил11111 иванович111', '1990-01-01'),
			('иванов11112 михаил11111 иванович111', '1990-01-01'), --25
			('иванов11113 михаил11111 иванович111', '1990-01-01'),
			('иванов11114 михаил11111 иванович111', '1990-01-01'),
			('иванов11115 михаил11111 иванович111', '1990-01-01'),
			('иванов11116 михаил11111 иванович111', '1990-01-01'),
			('иванов11117 михаил11111 иванович111', '1990-01-01'); --30

	/* --- clients --- */

		IF OBJECT_ID('tempdb.dbo.##clients', 'U') IS NOT null
		DROP TABLE ##clients;

		CREATE TABLE ##clients (
			  client_id INT IDENTITY(1, 1)
			, ank_no INT);

		INSERT INTO ##clients VALUES
			(1), (3), (5), (7), (9), (11), (13), (15), (17), (19), (21), (22), (24), (25), (26), (27), (28), (29), (30);

/*==================================================================================================================================================*/
/* --- --- Задание / Task --- --- */
/*==================================================================================================================================================*/

	-- Вывести все ФИО людей, которые не прошли регистрацию и старше 35

	SELECT full_name
	FROM ##ankets a
	WHERE 1=1
		AND NOT EXISTS (SELECT ank_no FROM ##clients c WHERE c.ank_no = a.ank_no)
		AND (YEAR(GETDATE()) - YEAR(a.birth_date)) > 35;

/*==================================================================================================================================================*/
/* --- --- Удалить временные таблицы / Delete temporary tables --- --- */
/*==================================================================================================================================================*/

	IF OBJECT_ID('tempdb.dbo.##ankets', 'U') IS NOT null DROP TABLE ##ankets;
	IF OBJECT_ID('tempdb.dbo.##clients', 'U') IS NOT null DROP TABLE ##clients;